InformationRegisters/СхемыМотивацииРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СхемыМотивацииРаботников</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.УправленческиеУдержания</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.УправленческиеНачисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ЗаполнениеНачислениямиДополнительный/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ДОКУМЕНТОВ НАЧИСЛЕНИЯМИ

Процедура ДобавитьОбъединенияВЗапросПолученияДействийСНачислениями(ТекстЗапроса, ПолеПодразделение, ПолеДолжность) Экспорт
	
	// В этой конфигурации структура печатных форм не дополняется

КонецПроцедуры

Процедура ДобавитьТаблицыВЗапросПолученияДействийСУправленческимиНачислениями(ТекстЗапроса) Экспорт
	
	ТекстЗапроса = ТекстЗапроса +  "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	ДанныеСотрудников.Физлицо КАК Физлицо,
	|	СхемыМотивацииРаботников.ВидРасчета КАК ВидРасчета,
	|	СхемыМотивацииРаботников.Показатель1,
	|	СхемыМотивацииРаботников.Показатель2,
	|	СхемыМотивацииРаботников.Показатель3,
	|	СхемыМотивацииРаботников.Показатель4,
	|	СхемыМотивацииРаботников.Показатель5,
	|	СхемыМотивацииРаботников.Показатель6,
	|	СхемыМотивацииРаботников.Валюта1,
	|	СхемыМотивацииРаботников.Валюта2,
	|	СхемыМотивацииРаботников.Валюта3,
	|	СхемыМотивацииРаботников.Валюта4,
	|	СхемыМотивацииРаботников.Валюта5,
	|	СхемыМотивацииРаботников.Валюта6,
	|	ДанныеСотрудников.ДатаДействия,
	|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка) КАК ТарифныйРазряд1,
	|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка) КАК ТарифныйРазряд2,
	|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка) КАК ТарифныйРазряд3,
	|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка) КАК ТарифныйРазряд4,
	|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка) КАК ТарифныйРазряд5,
	|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка) КАК ТарифныйРазряд6
	|ПОМЕСТИТЬ НачисленияСтаройПозицииСрезПоследних
	|ИЗ
	|	ДанныеСотрудников КАК ДанныеСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СхемыМотивацииРаботников КАК СхемыМотивацииРаботников
	|		ПО (СхемыМотивацииРаботников.ВидРасчета ССЫЛКА ПланВидовРасчета.УправленческиеНачисления
	|				ИЛИ СхемыМотивацииРаботников.ВидРасчета ССЫЛКА ПланВидовРасчета.УправленческиеУдержания)
	|			И (ВЫБОР
	|				КОГДА СхемыМотивацииРаботников.Подразделение = НЕОПРЕДЕЛЕНО
	|					ТОГДА ДанныеСотрудников.СтараяДолжность = СхемыМотивацииРаботников.Должность
	|				ИНАЧЕ ДанныеСотрудников.СтароеПодразделение = СхемыМотивацииРаботников.Подразделение
	|						И ДанныеСотрудников.СтараяДолжность = СхемыМотивацииРаботников.Должность
	|			КОНЕЦ)
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	ДанныеСотрудников.Физлицо КАК Физлицо,
	|	СхемыМотивацииРаботников.ВидРасчета КАК ВидРасчета,
	|	СхемыМотивацииРаботников.Показатель1,
	|	СхемыМотивацииРаботников.Показатель2,
	|	СхемыМотивацииРаботников.Показатель3,
	|	СхемыМотивацииРаботников.Показатель4,
	|	СхемыМотивацииРаботников.Показатель5,
	|	СхемыМотивацииРаботников.Показатель6,
	|	СхемыМотивацииРаботников.Валюта1,
	|	СхемыМотивацииРаботников.Валюта2,
	|	СхемыМотивацииРаботников.Валюта3,
	|	СхемыМотивацииРаботников.Валюта4,
	|	СхемыМотивацииРаботников.Валюта5,
	|	СхемыМотивацииРаботников.Валюта6,
	|	ДанныеСотрудников.ДатаДействия,
	|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка) КАК ТарифныйРазряд1,
	|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка) КАК ТарифныйРазряд2,
	|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка) КАК ТарифныйРазряд3,
	|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка) КАК ТарифныйРазряд4,
	|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка) КАК ТарифныйРазряд5,
	|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка) КАК ТарифныйРазряд6
	|ПОМЕСТИТЬ НачисленияНовойПозицииСрезПоследних
	|ИЗ
	|	ДанныеСотрудников КАК ДанныеСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СхемыМотивацииРаботников КАК СхемыМотивацииРаботников
	|		ПО (СхемыМотивацииРаботников.ВидРасчета ССЫЛКА ПланВидовРасчета.УправленческиеНачисления
	|				ИЛИ СхемыМотивацииРаботников.ВидРасчета ССЫЛКА ПланВидовРасчета.УправленческиеУдержания)
	|			И (ВЫБОР
	|				КОГДА СхемыМотивацииРаботников.Подразделение = НЕОПРЕДЕЛЕНО
	|					ТОГДА ДанныеСотрудников.Должность = СхемыМотивацииРаботников.Должность
	|				ИНАЧЕ ДанныеСотрудников.Подразделение = СхемыМотивацииРаботников.Подразделение
	|						И ДанныеСотрудников.Должность = СхемыМотивацииРаботников.Должность
	|			КОНЕЦ)
	|
	|;
	|";
	
КонецПроцедуры
